app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("name", "language", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Interstellar"], ["language", "English"], ["rating", 9], ["created_at", "2021-08-25 14:01:47.495264"], ["updated_at", "2021-08-25 14:01:47.495264"]]

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", 5], ["updated_at", "2021-08-25 15:26:36.564334"], ["id", 3]]

  def destroy
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]